_posts/2016-11-09-New-and-improved-asynchronous-org-babel-python-blocks.html
---
title: New and improved asynchronous org-babel python blocks
date: 2016/11/09 11:00:01
updated: 2016/11/09 11:00:01
categories: emacs,python,orgmode
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb1ee49d">1. autopep8</a></li>
<li><a href="#orgcca807a">2. pylint</a></li>
</ul>
</div>
</div>
<p>
About a year ago I posted some code to run org-babel python blocks <a href="http://kitchingroup.cheme.cmu.edu/blog/2015/11/20/Asynchronously-running-python-blocks-in-org-mode/">asynchronously</a>. This year, my students asked for some enhancements related to debugging. Basically, they were frustrated by a few things when they got errors. First, they found it difficult to find the line number in the Traceback in the src block because there are no line numbers in the block, and it is annoying to do a special edit just for line numbers.  
</p>

<p>
I thought about this, and figured out how to significantly improve the situation. The async python code in scimax now has the following features:
</p>

<ol class="org-ol">
<li>When you get a Traceback, it goes in the results, and each file listed in it is hyperlinked to the source file and line so it is easy to get to them.</li>
<li>The cursor jumps to the last line in the code block that is listed in the Traceback, and a beacon shines to show you the line</li>
<li>You can turn on temporary line numbers in the code block to see where the lines are in the block, and these disappear when you start typing. This is done in the variable `org-babel-async-python-show-line-numbers'.</li>
<li>You can control whether a buffer of the results shows or not via the variable `org-babel-async-python-show-results'.</li>
<li>When you run the block, you get a clickable link in the RESULTS section to kill the process.</li>
<li>You may also find the `autopep8' and `pylint' functions helpful.</li>
</ol>

<p>
The code for this is currently found here:
<a href="https://github.com/jkitchin/scimax/blob/org-9/scimax-org-babel-python.el">https://github.com/jkitchin/scimax/blob/org-9/scimax-org-babel-python.el</a>
</p>

<p>
Eventually, I will merge this into master, after I am sure about all the changes needed for org 9.0. That is not likely to happen until the semester ends, so I do not mess up my students who use scimax in class. So, sometime mid-December it will make into master.
</p>

<p>
To make async the default way to run a python block use this code, so that you can use C-c C-c to run them:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">scimax-org-babel-python</span>)
(add-to-list 'org-ctrl-c-ctrl-c-hook 'org-babel-async-execute:python)
</pre>
</div>

<p>
As with the past few posts, this video will make it much more clear what the post is about: 
</p>

<iframe width="560" height="315" src="https://www.youtube.com/embed/m4vCXM7_p_o" frameborder="0" allowfullscreen></iframe>


<p>
Here is a prototypical example that shows how it works. While it runs you can view the progress if you click on the link to show the results.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> time

<span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span>(5):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(i)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   time.sleep(2)
</pre>
</div>

<p>
0
1
2
3
4
Traceback (most recent call last):
  File "Org SRC", line 5, in &lt;module&gt;
    time.sleep(2)
KeyboardInterrupt
</p>




<p>
This block has a pretty obvious issue when we run it. The cursor jumps right to the problem!
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">print</span>(<span style="color: #008000;">'This line is ok'</span>)
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">5 / 0</span>
<span style="color: #0000FF;">print</span>(<span style="color: #008000;">'We will not see this'</span>)
</pre>
</div>

<p>
This line is ok
We will not see this
</p>



<p>
This block shows we can access any of the links in the Traceback. Here we have an error in calling a function that is raised in an external file.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> numpy <span style="color: #0000FF;">as</span> np
<span style="color: #0000FF;">from</span> scipy.integrate <span style="color: #0000FF;">import</span> odeint

<span style="color: #BA36A5;">Vspan</span> = np.linspace(0, 2) <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">L</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">dF/dV = F</span>
<span style="color: #0000FF;">def</span> <span style="color: #006699;">dFdV</span>(F, V, v0):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> F


<span style="color: #0000FF;">print</span>(odeint(dFdV, 1.0, Vspan))
</pre>
</div>

<p>
Traceback (most recent call last):
  File "Org SRC", line 11, in &lt;module&gt;
    print(odeint(dFdV, 1.0, Vspan))
  File "/Users/jkitchin/anaconda3/lib/python3.5/site-packages/scipy/integrate/odepack.py", line 215, in odeint
    ixpr, mxstep, mxhnil, mxordn, mxords)
TypeError: dFdV() missing 1 required positional argument: 'v0'
</p>


<p>
Here we show how nice it is to be able to kill a process. This block will not end on its own.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">while</span> <span style="color: #D0372D;">True</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">pass</span>
</pre>
</div>

<p>
Traceback (most recent call last):
  File "Org SRC", line 2, in &lt;module&gt;
    pass
KeyboardInterrupt
</p>

<div id="outline-container-orgb1ee49d" class="outline-2">
<h2 id="orgb1ee49d"><span class="section-number-2">1</span> autopep8</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://pypi.python.org/pypi/autopep8">autopep8</a> is a tool for reformatting Python code. We wrapped this into an Emacs command so you can quickly reformat a Python code block. 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #BA36A5;">a</span> = 4
<span style="color: #BA36A5;">b</span> = 5
<span style="color: #BA36A5;">c</span> = a * b  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">comment</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">another comment</span>


<span style="color: #0000FF;">def</span> <span style="color: #006699;">f</span>(x):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> x
<span style="color: #0000FF;">print</span>(f(5))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcca807a" class="outline-2">
<h2 id="orgcca807a"><span class="section-number-2">2</span> pylint</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://www.pylint.org">pylint</a> is a great tool for checking your Python code for errors, style and conventions. We also wrapped this into an Emacs command so you can run it on a Python src block. The report that is generated had clickable links to help you get right to the lines in your code block with problems.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> numpy <span style="color: #0000FF;">as</span> np

<span style="color: #BA36A5;">a</span> = np.array(5, 5)

<span style="color: #0000FF;">def</span> <span style="color: #006699;">f</span>(x): <span style="color: #0000FF;">return</span> x

<span style="color: #0000FF;">print</span>(f(6))
</pre>
</div>
</div>
</div>
<p>Copyright (C) 2016 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2016/11/09/New-and-improved-asynchronous-org-babel-python-blocks.org">org-mode source</a></p>
<p>Org-mode version = 9.0</p>